Revit 2026 API

# BuiltInFailuresColumnInsideWallFailures Class

---

Failures description ColumnInsideWall

SystemObject Autodesk.Revit.DBBuiltInFailuresColumnInsideWallFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ColumnInsideWallFailures
```
```vb
Public NotInheritable Class ColumnInsideWallFailures
```
```cpp
public ref class ColumnInsideWallFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ColumnInsideWallFailures = class end
```

The BuiltInFailuresColumnInsideWallFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColumnInsideWall | One element is completely inside another. |
|  | CopingWarningExtension | Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters. |
|  | CopingWarningIgnored | Cuts on concrete members are ignored. |
|  | CopingWarningMedium | Coping applied, but only in Medium Detail Level. |
|  | CopingWarningOffset | Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters. |
|  | StartCutShadowJoin | Two joined walls are in a position to allow automatic insert copying. |
|  | StopCutShadowJoin | Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping. |

#### Reference

Autodesk.Revit.DB Namespace